import 'package:flutter/material.dart';

class AboutScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {

    const String appDescription = '''
    
تطبيق "دعم الحياة" هو أداة مبتكرة مصممة خصيصًا لمساعدة الأشخاص الذين يعانون من مرض الزهايمر واضطراب الوسواس القهري (OCD) في تحسين جودة حياتهم اليومية. يجمع التطبيق بين أحدث التقنيات والتصميم البسيط لتقديم تجربة مستخدم فعالة وسهلة الاستخدام.

**مميزات التطبيق:**

1. **إدارة المهام والتذكيرات:**
   يساعد التطبيق المستخدمين على تنظيم أنشطتهم اليومية من خلال إنشاء قوائم مهام وتعيين تذكيرات لمواعيد الأدوية والأنشطة المهمة، مما يقلل من الشعور بالتشتت ويساهم في تحسين التركيز والالتزام بالروتين اليومي.

2. **تمارين الذاكرة والدماغ:**
   يحتوي التطبيق على مجموعة متنوعة من الألعاب والتمارين المصممة لتحفيز الذاكرة وتعزيز الوظائف الإدراكية. هذه التمارين تساعد في الحفاظ على نشاط الدماغ وتبطيء تقدم مرض الزهايمر.

3. **تقنيات الاسترخاء والتأمل:**
   يوفر التطبيق جلسات موجهة من التأمل وتمارين التنفس العميق التي تساعد في تقليل التوتر والقلق المرتبط باضطراب الوسواس القهري. تساعد هذه التقنيات المستخدمين على الوصول إلى حالة من الهدوء والتركيز.

4. **الدعم المجتمعي:**
   يتيح التطبيق للمستخدمين الانضمام إلى مجتمعات دعم افتراضية حيث يمكنهم تبادل التجارب والنصائح مع أشخاص يواجهون تحديات مشابهة. هذا الدعم الاجتماعي يعزز من الشعور بالانتماء ويقلل من الشعور بالوحدة.

5. **مراقبة الحالة الصحية:**
   يمكن للمستخدمين تتبع تقدمهم ومراقبة أعراضهم من خلال تقارير دورية، مما يساعد الأطباء والمختصين على تقديم الرعاية المناسبة بناءً على البيانات المتاحة. كما يمكن للمستخدمين تسجيل ملاحظات يومية حول حالتهم الصحية.

6. **الوصول إلى الموارد التعليمية:**
   يحتوي التطبيق على مكتبة من المقالات والفيديوهات التي تقدم معلومات قيمة حول كيفية التعامل مع مرض الزهايمر وOCD. تساهم هذه الموارد في زيادة الوعي والمعرفة لدى المستخدمين وأسرهم، مما يساعدهم على فهم أفضل للحالات وكيفية إدارتها بفعالية.

**فوائد التطبيق:**

- **تحسين التنظيم وإدارة الوقت:** يساعد التطبيق المستخدمين على تنظيم حياتهم اليومية بفعالية، مما يقلل من الشعور بالارتباك والتوتر ويعزز من الإنتاجية.
- **تعزيز الصحة العقلية:** من خلال تمارين الذاكرة وتقنيات الاسترخاء، يساهم التطبيق في تعزيز الصحة العقلية وتقليل الأعراض المرتبطة بالأمراض.
- **دعم اجتماعي متواصل:** يوفر التطبيق بيئة داعمة للمستخدمين للتواصل والتفاعل، مما يعزز من قدرتهم على التعامل مع التحديات اليومية بثقة أكبر.
- **سهولة الاستخدام:** تصميم واجهة المستخدم البسيطة والواضحة يجعل التطبيق سهل الاستخدام للأشخاص من جميع الفئات العمرية، بما في ذلك كبار السن الذين قد يكونون أقل دراية بالتكنولوجيا.

باختصار، "دعم الحياة" هو شريك موثوق للمستخدمين الذين يسعون لتحسين جودة حياتهم والتغلب على التحديات المرتبطة بمرض الزهايمر وOCD. من خلال توفير أدوات فعالة ودعم مستمر، يساعد التطبيق المستخدمين على تحقيق توازن أفضل في حياتهم اليومية والعيش بشكل أكثر استقلالية وراحة.
''';

    return Scaffold(
      appBar: AppBar(
        title: Text('حول التطبيق'),
      ),
      body: SingleChildScrollView( // لتمكين التمرير عند الحاجة
        padding: EdgeInsets.all(16.0), // إضافة بعض الهوامش
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start, // يبدأ من أعلى الشاشة
          children: [
            Text(
              'تطبيق الحياة',
              style: TextStyle(
                fontSize: 28,
                fontWeight: FontWeight.bold,
              ),
              textAlign: TextAlign.right, // محاذاة العنوان من اليمين
            ), // مسافة بين العنوان والنص
            Text(appDescription, // نص طويل للتجربة
              style: TextStyle(fontSize: 18),
              textAlign: TextAlign.right, // محاذاة النص من اليمين
            ),
          ],
        ),
      ),
    );
  }
}
